In [17]:
import pandas as pd

## Hay que hacer dos cosas, la primera es obtener un horizonte de 500 muestras y otro de 20

### Seg√∫n lo platicado en clase, entonces vamos a seguir las siguientes proporciones para la serie:

* Parte 1 
    * Horizonte: 500
    * Ventana  : 1000

* Parte 2
    * Horizonte: 20
    * Ventana  : 200 (para aprovechar que se pueden usar mas datos)

In [18]:
ruta = 'data/raw_data/nasdaq.csv'
df = pd.read_csv(ruta , names = ['Valores'])
df.head()

   Valores
0   459.33
1   460.90
2   459.39
3   458.22
4   458.71

### Seccionamiento Parte 1

In [27]:
ventana_1 = df[:1000]
horizonte_1 = df[1000:]

In [47]:
ventana_1.tail()

     Valores
995   769.35
996   767.89
997   761.49
998   760.74
999   759.72

In [29]:
horizonte_1.head()

      Valores
1000   751.47
1001   752.97
1002   755.53
1003   759.23
1004   760.15

In [30]:
ventana_1.to_csv('data/clean_data/v1.csv', index = True)
horizonte_1.to_csv('data/clean_data/h1.csv', index = True)

### Seccoinamiento Parte 2

In [43]:
ventana_2 = df[-200:-20]
horizonte_2 = df[-20:]

In [44]:
ventana_2.tail()

      Valores
1475   1036.1
1476   1040.5
1477   1057.3
1478   1065.7
1479   1062.1

In [45]:
horizonte_2.head()

      Valores
1480   1043.9
1481   1047.9
1482   1065.6
1483   1063.9
1484   1058.5

In [46]:
ventana_2.to_csv('data/clean_data/v2.csv', index = True)
horizonte_2.to_csv('data/clean_data/h2.csv', index = True)